Tekla Open API Reference for Tekla Structures 2025
ControlLine Constructor (LineSegment, Boolean)
 Creates a new control line instance taking the line segment and magnetism as input.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ControlLine(
	LineSegment Line,
	bool IsMagnetic
)
Public Sub New (
	Line As LineSegment,
	IsMagnetic As Boolean
)
Parameters
Line
Type: Tekla.Structures.Geometry3d.LineSegment
The line segment to be used.
IsMagnetic
Type: System.Boolean
Determines whether the line is magnetic or not.
See Also
Reference
ControlLine Class
ControlLine Overload
Tekla.Structures.Model Namespace